#Напишите программу, которая выводит строку:  "I love (hate?) Python
print('I love (hate?) Python')
attitudeToPython=str(input("What do you feel about Python(love or hate)?: "))
print(f'I {attitudeToPython} Python')

#Напишите программу, которая выводит на экран результат сложения двух чисел, например, 3 + 5
a=int(input("Enter int number 1: "))
b=int(input("Enter int number 2: "))
c=a+b
print(c)

